Тест_ЗУП_31_КОРП/src/Catalogs/ТестовыеВопросы/ТестовыеВопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТестовыеВопросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Задание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаРезультата</name>
    <type>
      <types>EnumRef.МетодыРасчетаРезультатаТестовогоВопроса</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВарианты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыТестовыхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасетныйВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
      <types>CatalogRef.ЭлементыЭлектронныхРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенРазвернутыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьИменаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеГрупп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКатегорий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВариантовОтветов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаПодсказку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальноеРазмещениеВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеВариантов</name>
    <type>
      <types>EnumRef.ОтображениеВариантовТестовыхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйВыводВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.УчебныеПрограммныеПродукты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьКомментарииКВариантамОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВариантыРаботыСПрограммойЭлектронногоОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполняетсяПрограммой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выделить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ЭлектронныеРесурсы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/ТипыТестовыхВопросов/ТипыТестовыхВопросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТестовыхВопросов</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ПоШаблону</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ЭлементActiveX</name>
  </enumValues>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>РаботаВПрограмме</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/МетодыРасчетаРезультатаТестовогоВопроса/МетодыРасчетаРезультатаТестовогоВопроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыРасчетаРезультатаТестовогоВопроса</name>
  <enumValues>
    <name>ТочноеСовпадение</name>
  </enumValues>
  <enumValues>
    <name>ПроцентВерных</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ТестовыеВопросы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногих
		ИЛИ ТипВопроса = Перечисления.ТипыТестовыхВопросов.МногиеИзМногих
		ИЛИ ТипВопроса = Перечисления.ТипыТестовыхВопросов.Таблица
		ИЛИ ТипВопроса = Перечисления.ТипыТестовыхВопросов.Последовательность
		ИЛИ ТипВопроса = Перечисления.ТипыТестовыхВопросов.Соответствие
		ИЛИ ТипВопроса = Перечисления.ТипыТестовыхВопросов.ПоШаблону Тогда
		
		
		
	КонецЕсли;
		
		
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;		
	
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоГруппа Тогда
		
		// МетодРасчетаРезультата
		
		Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ЭлементActiveX
			ИЛИ ТипВопроса = Перечисления.ТипыТестовыхВопросов.Открытый
			ИЛИ ТипВопроса = Перечисления.ТипыТестовыхВопросов.РаботаВПрограмме Тогда
			
			МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаТестовогоВопроса.ПустаяСсылка();
			
		КонецЕсли;
		
		Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногих
			ИЛИ ТипВопроса = Перечисления.ТипыТестовыхВопросов.ПоШаблону Тогда
			
			МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаТестовогоВопроса.ТочноеСовпадение;
			
		КонецЕсли;
		
		// РазрешенРазвернутыйОтвет
		
		Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.Открытый Тогда
			РазрешенРазвернутыйОтвет = Истина;
		КонецЕсли;
		
		Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ЭлементActiveX Тогда
			РазрешенРазвернутыйОтвет = Ложь;
		КонецЕсли;
		
		// Устанавливаем реквизит "ФасетныйВопрос".
		
		Если ТипВопроса <> Перечисления.ТипыТестовыхВопросов.ОдинИзМногих
			И ТипВопроса <> Перечисления.ТипыТестовыхВопросов.МногиеИзМногих
			И ТипВопроса <> Перечисления.ТипыТестовыхВопросов.ПоШаблону Тогда
			ФасетныйВопрос = Ложь;
		КонецЕсли;
		
		// ПоследовательныйВыводВариантов
		
		Если ТипВопроса <> Перечисления.ТипыТестовыхВопросов.Таблица
			И ТипВопроса <> Перечисления.ТипыТестовыхВопросов.Соответствие Тогда
			ПоследовательныйВыводВариантов = Ложь;
		КонецЕсли;
		
		// Очищаем значения параметров, заполняемых программой
		
		Для каждого СтрокаТЧ Из Параметры Цикл
			
			Если СтрокаТЧ.ЗаполняетсяПрограммой Тогда
				СтрокаТЧ.Значение = Неопределено;
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;
	
	РазработкаЭлектронныхКурсовСлужебный.ПроверитьВозможностьЗаписиЭлементаПередЗаписью(ЭтотОбъект, Отказ);
	РазработкаЭлектронныхКурсовСлужебный.УстановитьДатуИзмененияПередЗаписью(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#КонецЕсли
